package semestr_4.tests;

public class T2_TestTask {

    /*
    сначала пишем тесты к программе, а потом программу
    1. а) число -> список цифр
       б) сумма цифр

   сначала тесты, потом минимальная прога - пустой лист всегда возвращает, всегда ноль
   главное, чтобы компилировалось

    2.
     - settings больше не синглетон, он передается в конструктор класса, в которых он нужен
     - пишем теперь не через printstream, а buffered stream, потому что в нее
     удобно добавлять наовые данные

     - test
     на то, что в результате есть теги внутри <SVG> <Rect>

     */
}
